Revit 2026 API

# GenericZoneCreateSketchBased Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static GenericZone CreateSketchBased(
	Document doc,
	ElementId typeId,
	string name,
	GenericZoneDomainData domainData,
	ElementId levelId,
	IList<CurveLoop> curveLoops
)
```
```vb
Public Shared Function CreateSketchBased (
	doc As Document,
	typeId As ElementId,
	name As String,
	domainData As GenericZoneDomainData,
	levelId As ElementId,
	curveLoops As IList(Of CurveLoop)
) As GenericZone
```
```cpp
public:
static GenericZone^ CreateSketchBased(
	Document^ doc,
	ElementId^ typeId,
	String^ name,
	GenericZoneDomainData^ domainData,
	ElementId^ levelId,
	IList<CurveLoop^>^ curveLoops
)
```
```fsharp
static member CreateSketchBased :
        doc : Document *
        typeId : ElementId *
        name : string *
        domainData : GenericZoneDomainData *
        levelId : ElementId *
        curveLoops : IList<CurveLoop> -> GenericZone
```

#### Parameters

doc Document

typeId ElementId

name String

domainData GenericZoneDomainData

levelId ElementId

curveLoops IListCurveLoop

#### Return Value

GenericZone

#### Reference

GenericZone Class

Autodesk.Revit.DB.Analysis Namespace